Repository: TechUnRestricted/WinDiskWriter
Catalog: WinDiskWriter/LocalizedStrings/*.lproj/Localizable.strings
Languages: ru

# ALERT_SUBTITLE_IMAGE_WRITING_SUCCESS
source: Do not forget to properly remove the device to avoid data corruption.
ru: Не забудьте правильно извлечь устройство, чтобы избежать повреждения данных.

# ALERT_SUBTITLE_PATH_DOES_NOT_EXIST
source: The Path to the Image or Folder you entered does not exist.
ru: Путь к введенному образу или папке не существует.

# ALERT_SUBTITLE_PATH_FIELD_IS_EMPTY
source: The path to the Windows Image or Directory was not specified.
ru: Не указан путь к образу или папке Windows.

# ALERT_SUBTITLE_PRESS_UPDATE_BUTTON
source: Connect a compatible USB device and click on the Update button.
ru: Подключите совместимое USB-устройство и нажмите кнопку Обновить.

# ALERT_SUBTITLE_STOP_PROCESS
source: You will need to wait until the last file finish the copying.
ru: Вам нужно будет подождать, пока последний файл не завершит копирование.

# ALERT_TITLE_BSD_DEVICE_INFO_IS_OUTDATED_OR_INVALID
source: The information about this device is outdated or invalid.
ru: Информация об этом устройстве устарела или недействительна.

# ALERT_TITLE_BSD_DEVICE_IS_NO_LONGER_AVAILABLE
source: Chosen Device is no longer available.
ru: Выбранное устройство больше недоступно.

# BUTTON_TITLE_CANCEL
source: Cancel
ru: Отмена

# BUTTON_TITLE_CANCELLATION_SCHEDULE
source: Schedule the cancellation
ru: Запланировать отмену

# BUTTON_TITLE_CHOOSE
source: Choose
ru: Выбрать

# BUTTON_TITLE_DISMISS
source: Dismiss
ru: Отклонить

# BUTTON_TITLE_START
source: Start
ru: Начать

# BUTTON_TITLE_STOP
source: Stop
ru: Остановить

# BUTTON_TITLE_STOPPING
source: Stopping
ru: Остановка

# ALERT_TITLE_CHECK_DATA_CORRECTNESS
source: Check the correctness of the entered data.
ru: Проверьте правильность введенных данных.

# ALERT_TITLE_DISK_ERASE_FAILURE
source: Can't erase the destination device.
ru: Не удалось стереть устройство назначения.

# PROGRESS_TITLE_DISK_ERASE_SUCCESS
source: The destination device was successfully erased.
ru: Устройство назначения успешно стерто.

# ALERT_TITLE_FORGOT_SOMETHING
source: You forgot something...
ru: Вы что-то забыли...

# ALERT_TITLE_IMAGE_VERIFICATION_ERROR
source: Can't verify this Image.
ru: Не удалось проверить этот образ.

# ALERT_TITLE_IMAGE_WRITING_FAILURE
source: Something went wrong while writing files to the destination device.
ru: Что-то пошло не так при записи файлов на устройство назначения.

# ALERT_TITLE_IMAGE_WRITING_SUCCESS
source: Image writing completed successfully.
ru: Запись образа успешно завершена.

# INPUTVIEW_PLACEHOLDER_IMAGE_FILE_OR_DIRECTORY
source: Image File or Directory
ru: Файл образа или директория

# LABELVIEW_TITLE_WINDOWS_IMAGE
source: Windows Image
ru: Образ Windows

# MENU_TITLE_DONATE_ME
source: ❤️ Donate Me ❤️
ru: ❤️ Поддержать меня ❤️

# MENU_TITLE_EDIT
source: Edit
ru: Правка

# MENU_TITLE_HIDE
source: Hide
ru: Скрыть

# MENU_TITLE_ITEM_ABOUT
source: About
ru: О программе

# MENU_TITLE_ITEM_COPY
source: Copy
ru: Скопировать

# MENU_TITLE_ITEM_CUT
source: Cut
ru: Вырезать

# MENU_TITLE_ITEM_OPEN_DONATION_WEB_PAGE
source: Open Donation Web Page
ru: Открыть страницу пожертвований

# MENU_TITLE_ITEM_PASTE
source: Paste
ru: Вставить

# MENU_TITLE_ITEM_QUIT
source: Quit
ru: Закрыть

# MENU_TITLE_ITEM_SELECT_ALL
source: Select All
ru: Выбрать все

# MENU_TITLE_MINIMIZE
source: Minimize
ru: Свернуть

# MENU_TITLE_WINDOW
source: Window
ru: Окно

# ALERT_TITLE_NO_WRITABLE_DEVICES
source: No writable devices found.
ru: Не найдено доступных для записи устройств.

# ALERT_SUBTITLE_PROMPT_START_PROCESS
source: You will lose all data on the selected device.
ru: Вы уверены, что хотите начать?

# PROGRESS_TITLE_READY_FOR_ACTION
source: Ready for action
ru: Можно начать запись

# ALERT_TITLE_STOP_PROCESS
source: Do you want to stop the process?
ru: Вы хотите остановить процесс?

# LABELVIEW_TITLE_TARGET_DEVICE
source: Target Device
ru: Устройство назначения

# BUTTON_TITLE_UPDATE
source: Update
ru: Обновить

# CHECKBOXVIEW_TITLE_PATCH_INSTALLER_REQUIREMENTS
source: Patch Installer Requirements
ru: Пропатчить требования установщика

# CHECKBOXVIEW_TOOLTIP_PATCH_INSTALLER_REQUIREMENTS
source: Remove TPM, Secure Boot and RAM requirements from the installer. (Windows 11 only)
ru: Убрать требования ОЗУ, TPM и Secure Boot из установщика. (Только для Windows 11)

# CHECKBOXVIEW_TITLE_INSTALL_LEGACY_BOOT_SECTOR
source: Install Legacy BIOS Boot Sector
ru: Установить загрузный сектор для Legacy BIOS

# CHECKBOXVIEW_TOOLTIP_INSTALL_LEGACY_BOOT_SECTOR
source: Add support for older firmwares that don't support booting from EFI.
ru: Добавить поддержку старых BIOS, которые не поддерживают EFI загрузчку.

# TOOLTIP_FRAMELAYOUT_FORMATTING_SECTION
source: Desired filesystem for the destination device. (FAT32 is the best choice for compatibility)
ru: Желаемая файловая система для устройства назначения. (FAT32 является наиболее совместимой файловой системой)

# LABELVIEW_TITLE_FILESYSTEM
source: File System
ru: Файловая система

# ALERT_TITLE_FAILED_TO_RESTART
source: Failed to restart
ru: Ошибка перезапуска

# ALERT_TITLE_REQUIRE_RESTART_AS_ROOT
source: This option requires the application to be relaunched with Root Permissions
ru: Для данной операции требуется перезапустить приложение с правами администратора

# ALERT_SUBTITLE_REQUIRE_RESTART_AS_ROOT
source: All unsaved changes will be lost
ru: Все несохранённые изменения будут утеряны

# BUTTON_TITLE_RELAUNCH
source: Relaunch
ru: Перезапустить

# PROGRESS_TITLE_FORMATTING_THE_DRIVE
source: Formatting the drive
ru: Форматирование диска

# PROGRESS_TITLE_CREATE_DIRECTORY
source: Create directory
ru: Создание директории

# PROGRESS_TITLE_WRITE_FILE
source: Write File
ru: Запись файла

# PROGRESS_TITLE_SPLIT_IMAGE
source: Split Image
ru: Разделение образа

# PROGRESS_TITLE_EXTRACT_BOOTLOADER
source: Extract Bootloader
ru: Распаковка загрузчика

# PROGRESS_TITLE_PATCH_INSTALLER_REQUIREMENTS
source: Patch Installer Requirements
ru: Патчинг требований установщика

# PROGRESS_TITLE_INSTALL_LEGACY_BOOTLOADER
source: Install Legacy Bootloader
ru: Установка загрузчика для Legacy BIOS

# LOGVIEW_ROW_PARTIAL_TITLE_ERROR_MESSAGE
source: (Error message: '%@')
ru: (Сообщение об ошибке: '%@')

# LOGVIEW_ROW_TITLE_IMAGE_MOUNT_SUCCESS
source: Image was successfully mounted
ru: Образ успешно смонтирован

# LOGVIEW_ROW_TITLE_GENERATED_PARTITION_NAME
source: Generated partition name
ru: Сгенерированное название раздела

# LOGVIEW_ROW_TITLE_TARGET_PARTITION_PATH
source: Target partition path
ru: Путь к разделу назначения

# LOGVIEW_ROW_TITLE_DISK_ERASE_OPERATION_OPTIONS
source: Device %@ (%@ %@) is ready to be erased with the following properties: (partition_name: '%@', partition_scheme: '%@', filesystem: '%@', patch_installer_requirements: '%d', install_legacy_boot: '%d').
ru: Устройство %@ (%@ %@) готово к форматированию со следующими параметрами: (название_раздела: '%@', схема_разделов: '%@', файловая_система: '%@', патч_системных_требований: '%d', установить_загрузчик_legacy_bios: '%d').

# ALERT_TITLE_WRITE_FILE_PROBLEM_OCCURRED
source: A problem occurred while writing the file to disk
ru: Произошла проблема во время записи файла на диск

# ALERT_SUBTITLE_WRITE_FILE_PROBLEM_OCCURRED
source: Would you like to skip this file, or stop writing?
ru: Вы можете пропустить этот файл или остановить запись.

# PLACEHOLDER_REASON
source: (Reason: %@)
ru: (Причина: %@)

# ALERT_BUTTON_TITLE_STOP_WRITING
source: Stop Writing
ru: Остановить запись

# ALERT_BUTTON_TITLE_SKIP_FILE
source: Skip File
ru: Пропустить файл

# LOGVIEW_ROW_TITLE_CLEARING_DEVICE_PICKER_LIST
source: Clearing the device picker list.
ru: Очистка списка устройств.

# LOGVIEW_ROW_PARTIAL_TITLE_FOUND_DEVICES
source: Found devices
ru: Найдены устройства

# MENU_TITLE_ITEM_CLOSE
source: Close
ru: Закрыть

# ERROR_TEXT_CANT_DETERMINE_BSD_PATH
source: Can't determine the BSD path for the destination device.
ru: Не удалось определить BSD имя устройства назначения.

# ERROR_TEXT_BOOTLOADER_MBR_FILE_DOESNT_EXIST
source: Bootloader MBR file doesn't exist.
ru: Файл загрузчика MBR не существует.

# ERROR_TEXT_BOOTLOADER_GRLDR_FILE_DOESNT_EXIST
source: Bootloader Grldr file doesn't exist.
ru: Файл загрузчика Grldr не существует.

# ERROR_TEXT_BOOTLOADER_MENU_FILE_DOESNT_EXIST
source: Bootloader Menu file doesn't exist.
ru: Файл загрузчика Menu не существует.

# ERROR_TEXT_BOOTLOADER_MBR_OPEN_FILE_INPUT_HANDLE_FAILURE
source: Can't open the input handle for the MBR file.
ru: Не удается открыть входной дескриптор для файла MBR.

# ERROR_TEXT_OUTPUT_DEVICE_OPEN_FAILURE
source: Can't open the output device.
ru: Не удалось открыть устройство назначения.

# ERROR_TEXT_GET_AVAILABLE_SPACE_FAILURE
source: Can't get the available space for the specified path.
ru: Ошибка получения доступного пространства для указанного пути.

# ERROR_TEXT_DISK_SPACE_NOT_ENOUGH
source: Not enough free disk space.
ru: Недостаточно свободного места на диске.

# ERROR_TEXT_FILE_COPY_FAILURE_OVER_FAT32_SIZE_LIMIT
source: Can't copy this file to the FAT32 volume due to filesystem limitations.
ru: Не удалось скопировать данный файл на FAT32 из-за ограничений файловой системы.

# ERROR_TEXT_OPEN_SOURCE_FILE_FAILURE
source: Couldn't open the source file.
ru: Не удалось открыть исходный файл.

# ERROR_TEXT_OPEN_DESTINATION_PATH_FAILURE
source: Couldn't open the destination file path.
ru: Не удалось открыть путь к файлу на диске назначения.

# ERROR_TEXT_ALLOCATE_MEMORY_BUFFER_FAILURE
source: Couldn't allocate memory for buffer.
ru: Не удалось выделить память для буфера.

# ERROR_TEXT_WRITE_DESTINATION_PATH_DATA_FAILURE
source: Can't write data to destination path.
ru: Не удалось записать данные на устройство назначения.

# ERROR_TEXT_SPLITTING_ESD_SWM_NOT_SUPPORTED
source: Splitting Windows Install Images with .esd and .swm extensions is currently not supported.
ru: Разделение установочных файлов Windows с расширениями .esd и .swm на данный момент недоступно.

# ERROR_TEXT_DESTINATION_PATH_DOES_NOT_EXIST
source: Destination path does not exist.
ru: Путь назначения не существует.

# ERROR_TEXT_GET_AVAILABLE_DESTINATION_DISK_SPACE_FAILURE
source: Can't get the available space for the destination disk.
ru: Ошибка получения доступного пространства для диска назначения.

# ERROR_TEXT_SOURCE_IS_TOO_LARGE_FOR_THE_DESTINATION_DISK
source: Source is too large for the destination disk.
ru: Источник слишком велик для диска назначения.

# LABELVIEW_TITLE_VERSION
source: Version
ru: Версия

# LABELVIEW_TITLE_ADDITIONAL_INFORMATION
source: Additional Information
ru: Дополнительная информация

# DADISK_ERROR_TEXT_UNSPECIFIED
source: An unspecified error occurred.
ru: Произошла неизвестная ошибка.

# DADISK_ERROR_TEXT_BUSY
source: The disk is busy.
ru: Диск занят.

# DADISK_ERROR_TEXT_BAD_ARGUMENT
source: An invalid argument was passed to the function.
ru: В функцию передан некорректный аргумент.

# DADISK_ERROR_TEXT_EXCLUSIVE_ACCESS
source: The disk is locked and cannot be modified.
ru: Диск заблокирован и не может быть модифицирован.

# DADISK_ERROR_TEXT_NO_RESOURCES
source: There are not enough resources to complete the operation.
ru: Недостаточно системных ресурсов для выполнения данной операции.

# DADISK_ERROR_TEXT_NOT_FOUND
source: The disk or the volume was not found.
ru: Диск или раздел не найден.

# DADISK_ERROR_TEXT_NOT_MOUNTED
source: The disk is not mounted.
ru: Диск не смонтирован.

# DADISK_ERROR_TEXT_NOT_PERMITTED
source: The operation is not permitted.
ru: Нет разрешения на выполнение данной операции.

# DADISK_ERROR_TEXT_NOT_PRIVILEGED
source: The user does not have the required privileges.
ru: У пользователя недостаточно привилегий для выполнения операции.

# DADISK_ERROR_TEXT_NOT_READY
source: The disk is not ready.
ru: Диск не готов.

# DADISK_ERROR_TEXT_NOT_WRITABLE
source: The disk or the volume is not writable.
ru: Диск или раздел не имеет разрешения на запись.

# DADISK_ERROR_TEXT_UNSUPPORTED
source: The operation is not supported by the disk.
ru: Операция не поддерживается диском.

# ERROR_TEXT_SPECIFIED_BSD_NAME_DOESNT_EXIST_CANT_ERASE
source: Specified BSD name does not exist. Can't erase this volume.
ru: Указанное BSD имя не существует. Невозможно стереть данный раздел.

# ERROR_TEXT_COMMAND_LINE_EXECUTE_FAILURE
source: An error occurred while executing the command.
ru: Произошла ошибка при выполнении команды.

# ERROR_TEXT_CANT_GET_ERROR_OUTPUT_PIPE
source: Can't retrieve the information from the command line error output pipe.
ru: Не удается получить информацию из канала вывода ошибок командной строки.

# ERROR_TEXT_CANT_PARSE_HDIUTIL_OUTPUT
source: An error occurred while reading output from hdiutil.
ru: Произошла ошибка при чтении вывода из hdiutil.

# ERROR_TEXT_PLIST_CANT_LOAD_SYSTEM_ENTITIES
source: Can't load "system-entities" from parsed plist.
ru: Не удалось загрузить "system-entities" из полученного plist файла.

# ERROR_TEXT_PLIST_SYSTEM_ENTITIES_IS_EMPTY
source: This image does not contain any System Entity.
ru: Этот образ не содержит ни одной System Entity.

# ERROR_TEXT_PLIST_SYSTEM_ENTITIES_COUNT_MORE_THAN_ONE
source: The number of System Entities in this image is >1. The required Entity could not be determined. Try to specify the path to an already mounted image.
ru: Количество System Entities в этом образе больше 1. Не удалось определить необходимый System Entity. Попробуйте указать путь к уже смонтированному образу.

# ERROR_TEXT_HDIUTIL_STATUS_WAS_NOT_EXIT_SUCCESS
source: The exit status of hdiutil was not EXIT_SUCCESS.
ru: Утилита hdiutil была завершена со статусом, отличным от EXIT_SUCCESS.

# ERROR_TEXT_UNMOUNT_DESTINATION_DEVICE_FAILURE
source: Can't unmount the destination device
ru: Не удалось размонтировать устройство назначения.

# ERROR_TEXT_APPLICATION_ARGUMENTS_LIST_IS_EMPTY
source: Application arguments list is empty.
ru: Список аргументов запуска пуст.

# ERROR_TEXT_APPLICATION_ARGUMENTS_BAD_STRUCTURE
source: The first object of application arguments list is not a file.
ru: Первый объект из списка аргументов не является файлом.

# AUTHORIZATION_ERROR_INVALID_SET
source: The set parameter is invalid.
ru: Параметр set недействителен.

# AUTHORIZATION_ERROR_INVALID_REF
source: The authorization parameter is invalid.
ru: Параметр авторизации недействителен.

# AUTHORIZATION_ERROR_INVALID_TAG
source: The authorization tag is invalid.
ru: Тег авторизации недействителен.

# AUTHORIZATION_ERROR_INVALID_POINTER
source: The authorizedRights parameter is invalid.
ru: Параметр authorizedRights недействителен.

# AUTHORIZATION_ERROR_DENIED
source: The authorization was denied.
ru: Отказано в авторизации.

# AUTHORIZATION_ERROR_CANCELED
source: The authorization was canceled by the user.
ru: Авторизация отменена пользователем.

# AUTHORIZATION_ERROR_INTERACTION_NOT_ALLOWED
source: The authorization was denied since no user interaction was possible.
ru: Авторизация была отклонена, так как невозможно взаимодействие с пользователем.

# AUTHORIZATION_ERROR_INTERNAL
source: An unrecognized internal error occurred.
ru: Возникла неизвестная внутренняя ошибка.

# AUTHORIZATION_ERROR_EXTERNALIZE_NOT_ALLOWED
source: The Security Server denied externalization of the authorization reference.
ru: Сервер безопасности отказал во внешнем представлении ссылки на авторизацию.

# AUTHORIZATION_ERROR_INTERNALIZE_NOT_ALLOWED
source: The Security Server denied internalization of the authorization reference.
ru: Сервер безопасности отказал во внутреннем представлении ссылки на авторизацию.

# AUTHORIZATION_ERROR_INVALID_FLAGS
source: The provided option flag(s) are invalid for this authorization operation.
ru: Предоставленные флаги опций недействительны для этой операции авторизации.

# AUTHORIZATION_ERROR_TOOL_EXECUTE_FAILURE
source: The tool failed to execute.
ru: Вспомогательный инструмент не удалось выполнить.

# AUTHORIZATION_ERROR_TOOL_ENVIRONMENT_ERROR
source: The attempt to execute the tool failed to return a success or an error code.
ru: Попытка запустить вспомогательный инструмент не вернула код успеха или ошибки.

# AUTHORIZATION_ERROR_BAD_ADDRESS
source: The requested socket address is invalid (must be 0-1023 inclusive).
ru: Запрошенный адрес сокета не является валидным (должен быть в диапазоне 0-1023 включительно).

# ERROR_TEXT_FILE_TYPE_IS_NOT_ISO
source: This file does not have an .iso extension.
ru: Данный файл не имеет .iso расширения.

# ERROR_TEXT_INIT_WITH_VOLUME_PATH_UNSUPPORTED
source: Can't load the destination device info from mounted volume on this Mac OS X version.
ru: На данной версии Mac OS X невозможно получить информацию об устройстве назначения при помощи пути смонтированного раздела.

# ERROR_CANT_COPY_FILE_TO_DESTINATION_DEVICE
source: Can't copy '%@' to the destination device.
ru: На удалось скопировать %@ на устройство назначения.

# ERROR_FILE_OR_DIRECTORY_DOESNT_EXIST
source: File (directory) '%@' doesn't exist.
ru: Файл (директория) '%@' не существует.
